app/views/buttons/_popup.html.haml

SELECT "buttons".* FROM "buttons" WHERE "buttons"."category_id" = 7 ORDER BY position
---
        .generic-button-cool.popup-hide-button{ :onclick => '$("#buttons").hide()'} X
      - @button_categories.each do |cat|
        .button-category.generic-button-cool{ :onclick => "sr.fn.buttons.showCategoryContainer('button-category-container-#{ cat.id }')" }= cat.name

SELECT "items".* FROM "items" WHERE "items"."vendor_id" = 1 AND "items"."sku" = 'SKU13' LIMIT 1
---
              - color = b.color ? "background-color: #{ b.color }" : ""
              - item = @current_vendor.items.find_by_sku(b.sku)