app/views/shared/_application_js.html.erb

SELECT "countries".* FROM "countries" WHERE "countries"."vendor_id" = 1
---
sr.data.resources.sale_type_array = <%= raw @current_vendor.sale_types.to_json %>;
sr.data.resources.country_array = <%= raw @current_vendor.countries.to_json %>;