app/views/shared/_cash_drop.html.erb

SELECT "users".* FROM "users" INNER JOIN "users_vendors" ON "users"."id" = "users_vendors"."user_id" WHERE "users_vendors"."vendor_id" = 1
---
        <select name="user_id" id="user_id">
          <% @current_vendor.users.each do |emp|  %>

SELECT "drawer_transactions".* FROM "drawer_transactions" WHERE "drawer_transactions"."vendor_id" = 1 ORDER BY "drawer_transactions"."id" DESC LIMIT 1
---
          # prefil amount if cash_drawer is empty
          last_dt = @current_vendor.drawer_transactions.last