app/views/shared/_dt_tags.html.erb

SELECT "transaction_tags".* FROM "transaction_tags" WHERE "transaction_tags"."vendor_id" = 1
---
  </div>
  <% @current_vendor.transaction_tags.each do |tag| %>