app/views/orders/_last_orders.html.haml

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND "orders"."completed_at" IS NULL ORDER BY updated_at DESC LIMIT 5
---
    %h2= t 'menu.last_uncompleted'
    - @current_vendor.orders.where(:completed_at => nil).order("updated_at DESC").limit(5).each do |o|
      .recent-order{ :onmousedown => "window.location='/orders/#{ o.id }/edit';", :style => "background-color: #{ o.cash_register.color };" }

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND (completed_at IS NOT NULL) ORDER BY nr DESC LIMIT 5
---
    %h2= t 'menu.last_completed'
    - @current_vendor.orders.where("completed_at IS NOT NULL").order("nr DESC").limit(5).each do |o|
      .recent-order{ :style => "background-color: #{ o.cash_register.color };" }