app/views/vendors/sales_statistics.html.haml

    - total_cents = 0
    - @reports[:order_item_quantities_by_category].each do |arr|
---
SELECT "categories".* FROM "categories" WHERE "categories"."vendor_id" = 1 AND "categories"."id" = 5 LIMIT 1

            = @current_vendor.categories.find_by_id(arr["category_id"]).name
        %td= @current_vendor.items.find_by_id(arr["item_id"]).name
---
SELECT "items".* FROM "items" WHERE "items"."vendor_id" = 1 AND "items"."id" = 27 LIMIT 1