app/controllers/items_controller.rb

  def index
    orderby = "id DESC"
    orderby ||= params[:order_by]

    if params[:keywords] and params[:keywords].blank?
      # user has cleared the field
      @keywords = session[:keywords] = nil
    elsif not params[:keywords].blank?
      @keywords = session[:keywords] = params[:keywords]
    elsif not session[:keywords].blank?
      @keywords = session[:keywords]
    end

    if @keywords
      @items = @current_vendor.items.by_keywords(@keywords).where("items.sku NOT LIKE 'DMY%'")
      child_item_skus = []
      # log_action "XXXXX[recursive find]: @items #{ @items.collect{ |i| i.sku } }"
      @items.each do |i|
        # log_action "XXXXX[recursive find]: finding upmost parent for Item id #{ i.id }"
        upmost_parent_sku = i.recursive_parent_sku_chain.last
        # log_action "XXXXX[recursive find]: upmost parent sku is #{ upmost_parent_sku }"
        upmost_parent = @current_vendor.items.find_by_sku(upmost_parent_sku)

        bottom_most_child = upmost_parent.recursive_child_sku_chain.last
        # log_action "XXXXX[recursive find]: bottom most child sku is #{ bottom_most_child }"
        child_item_skus << bottom_most_child
      end
      @items = @current_vendor.items.where(:sku => child_item_skus).page(params[:page]).per(@current_vendor.pagination)
---
SELECT "items".* FROM "items" WHERE "items"."vendor_id" = 1 AND (items.sku NOT LIKE 'DMY%') AND (child_id = 0 or child_id IS NULL) ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "items" WHERE "items"."vendor_id" = 1 AND (items.sku NOT LIKE 'DMY%') AND (child_id = 0 or child_id IS NULL)

  def search
    @items = []
    @customers = []
    @orders = []

    if params[:klass] == 'Item' then
      if params[:keywords].empty? then
        @items = @current_vendor.items.page(params[:page]).per(@current_vendor.pagination)
---
SELECT "items".* FROM "items" WHERE "items"."vendor_id" = 1 AND ((lower(name) LIKE '%item%' OR lower(sku) like '%item%') AND quantity > 0 )
SELECT COUNT(*) FROM "items" WHERE "items"."vendor_id" = 1 AND ((lower(name) LIKE '%item%' OR lower(sku) like '%item%') AND quantity > 0 )