app/controllers/orders_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", "11"]]
---
  def getItem
    stock = OrderItem.find(params[:id]).item.quantity

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND (completed_at IS NOT NULL) ORDER BY completed_at DESC LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND "orders"."completed_at" IS NULL ORDER BY updated_at DESC LIMIT 5
SELECT "categories".* FROM "categories" WHERE "categories"."vendor_id" = 1 AND "categories"."button_category" = 't' ORDER BY position
---
  def new
    unless params[:keywords].blank?
      redirect_to "/items?keywords=#{ params[:keywords] }"
    end

    # get the user's current order
    @current_order = @current_vendor.orders.where(:completed_at => nil).find_by_id(@current_user.current_order_id)
    # Get the last completed order, period, not scoped by user.
    # This is so that the API can notify the website.
    @last_completed_order = @current_vendor.orders.where('completed_at IS NOT NULL').order('completed_at DESC').first
    if @last_completed_order.nil? then
      @last_completed_order = Order.new
    end
    # create a new order if the previous fails
    unless @current_order
      @current_order = Order.new
      @current_order.vendor = @current_vendor
      @current_order.company = @current_company
      @current_order.currency = @current_vendor.currency
      @current_order.user = @current_user
      @current_order.cash_register = @current_register
      @current_order.drawer = @current_user.get_drawer
      @current_order.save!
      # remember this for the current user
      @current_user.current_order_id = @current_order.id
      @current_user.save!
    end

    @button_categories = @current_vendor.categories.where(:button_category => true).order(:position)

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND "orders"."id" = 3 LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "users_vendors" ON "users"."id" = "users_vendors"."user_id" WHERE "users_vendors"."vendor_id" = 1 AND "users"."current_order_id" = 3 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" = 27 LIMIT 1
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "order_items" ("action_applied", "activated", "behavior", "calculate_part_price", "category_id", "company_id", "completed_at", "coupon_amount_cents", "coupon_id", "created_at", "currency", "discount", "discount_amount_cents", "drawer_id", "gift_card_amount_cents", "hidden", "hidden_at", "hidden_by", "is_buyback", "is_proforma", "is_quote", "is_unpaid", "item_id", "item_type_id", "location_id", "no_inc", "order_id", "paid", "paid_at", "price_cents", "quantity", "rebate", "rebate_amount_cents", "refund_payment_method_item_id", "refunded", "refunded_at", "refunded_by", "sku", "tax", "tax_amount_cents", "tax_profile_id", "total_cents", "updated_at", "user_id", "vendor_id", "weigh_compulsory") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46) RETURNING "id"
SELECT "items".* FROM "items" WHERE "items"."vendor_id" = 1 AND "items"."sku" = 'SKU32' LIMIT 1
---
  def add_item_ajax
    @order = @current_vendor.orders.find_by_id(params[:order_id])

    unless @order.completed_at.nil?
      # the requested order is already completed. We cannot edit that and rediect to #new.
      $MESSAGES[:prompts] << I18n.t("views.notice.edit_completed_order")
      render :update_pos_display
      return
    end

    user_which_has_requested_order = @current_vendor.users.find_by_current_order_id(@order.id)

    if user_which_has_requested_order and user_which_has_requested_order != @current_user
      # another user is editing this order. We cannot edit that and redirect to #new.
      $MESSAGES[:prompts] << I18n.t("views.notice.edit_order_by_other_user", :username => user_which_has_requested_order.username)
      render :update_pos_display
      return
    end

    @order_item, redraw_all_order_items = @order.add_order_item(params)
    @order_items = []

    if @order_item
      if redraw_all_order_items == true
        @order_items = @order.order_items
      else
        @order_items << @order_item
      end

      if @order_item.behavior == 'coupon'
        @matching_coupon_item = @order.order_items.find_by_sku(@order_item.item.coupon_applies)

SELECT "order_items".* FROM "order_items" WHERE "order_items"."vendor_id" = 1 AND "order_items"."id" = 3 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 3 LIMIT 1
DELETE FROM "order_items" WHERE "order_items"."id" = 3
---
  def delete_order_item
    @order_items = []
    @order_item = @current_vendor.order_items.find_by_id(params[:id])
    @order = @order_item.order
    if @order.completed_at
      $MESSAGES[:prompts] << I18n.t("system.errors.deletion_of_item_when_order_completed")
      render :update_pos_display
      return
    end
    # @order_item.hide(@current_user)
    @order_item.delete

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND "orders"."id" = 4 LIMIT 1
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = 1 LIMIT 1
---
  def print_receipt
    @order = @current_vendor.orders.find_by_id(params[:order_id])
    if @current_register.salor_printer
      contents = @order.escpos_receipt
      output = Escper::Printer.merge_texts(contents[:text], contents[:raw_insertations])
      if params[:download] then
        send_data(output, {:filename => 'salor.bill'})
      else
        render :text => output and return
      end
    else
      @order.print(@current_register)
      render :nothing => true and return
    end

    r = Receipt.new
    r.vendor = @current_vendor
    r.company = @current_company
    r.order = @order

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND "orders"."completed_at" IS NULL AND "orders"."id" = 3 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "orders" SET "paid" = 't', "paid_at" = '2016-10-10 08:51:09.731623', "updated_at" = '2016-10-10 08:51:09.733201' WHERE "orders"."id" = 3
UPDATE "users" SET "current_order_id" = 4, "updated_at" = '2016-10-10 08:51:09.956658' WHERE "users"."id" = 1
UPDATE "vendors" SET "largest_order_number" = 3, "updated_at" = '2016-10-10 08:51:09.761505', "unused_order_numbers" = '--- []
---
  def complete
    @order = @current_vendor.orders.where(:completed_at => nil).find_by_id(params[:order_id])

    if @order.nil?
      raise "@order is nil in OrdersController. This should not have happened."
    end

    #History.record("Initialized order for complete", @order)

    if params[:change_user_id] and params[:change_user_id] != @current_user.id then
      tmp_user = @current_vendor.users.find_by_id(params[:change_user_id])
      if tmp_user
        History.record("swapping user #{@current_user.id} with #{tmp_user.id}",@order)

        @order.user = tmp_user
        @order.save!

INSERT INTO "orders" ("buy_order", "cash_cents", "cash_register_id", "change_cents", "company_id", "completed_at", "created_at", "currency", "customer_id", "delivery_note_comment", "destination_country_id", "drawer_id", "hidden", "hidden_at", "hidden_by", "invoice_comment", "is_proforma", "is_quote", "is_unpaid", "lc_amount_cents", "lc_points", "location_id", "noncash_cents", "nr", "origin_country_id", "paid", "paid_at", "payment_due", "payment_total_cents", "proforma_order_id", "qnr", "rebate", "rebate_amount_cents", "sale_type_id", "sku", "subscription", "subscription_interval", "subscription_last", "subscription_next", "subscription_order_id", "subscription_start", "tag", "tax", "tax_amount_cents", "tax_profile_id", "total_cents", "updated_at", "user_id", "vendor_id", "was_printed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50) RETURNING "id"
---
    @order.user = @current_user
    @order.drawer = @current_user.get_drawer
    @order.cash_register = @current_register
    result = @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."vendor_id" = 1 AND "orders"."id" = 3 LIMIT 1
---
  def print
    @order = @current_vendor.orders.find_by_id(params[:id])