app/controllers/sessions_controller.rb

SELECT "companies".* FROM "companies" LIMIT 1
SELECT "vendors".* FROM "vendors" WHERE "vendors"."company_id" = 1 LIMIT 1
---
  def new
    @submit_path = session_path
    @company = Company.first
    @vendor = @company.vendors.first

SELECT "companies".* FROM "companies" LIMIT 1
SELECT "user_logins".* FROM "user_logins" WHERE "user_logins"."user_id" = 1 ORDER BY "user_logins"."id" DESC LIMIT 1
SELECT "vendors".* FROM "vendors" INNER JOIN "users_vendors" ON "vendors"."id" = "users_vendors"."vendor_id" WHERE "users_vendors"."user_id" = 1 LIMIT 1
UPDATE "users" SET "sign_in_count" = 9, "current_sign_in_at" = '2016-10-15 13:06:44.007928', "current_sign_in_ip" = '192.168.8.95', "updated_at" = '2016-10-15 13:06:44.080125' WHERE "users"."id" = 1
---
  def create
    # Simple local login
    company = Company.first
    user = company.login(params[:code])

    if user
      vendor = user.vendors.first
      session[:user_id_hash] = user.id_hash
      session[:company_id] = company.id
      session[:vendor_id] = vendor.id
      session[:locale] = I18n.locale = user.language

      user.sign_in_count += 1
      user.current_sign_in_at = Time.now
      user.current_sign_in_ip = request.ip
      user.save