app/controllers/vendors_controller.rb

  def edit_field_on_child
    klass = params[:klass].constantize
    company = @current_vendor.company
    @inst = klass.where(:company_id => company).find_by_id(params[:id])

    if @inst.nil?
      raise "edit_field_on_child: @inst is nil. The model with ID #{ params[:id] } probably not existing."
    end

    log_action "edit_field_on_child called. @inst.class is #{ @inst.class }"

    value = params[:value]
    if @inst.respond_to?("#{ params[:field] }=".to_sym)

      if @inst.class == OrderItem

        if @inst.order.completed_at
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 7 LIMIT 1

      # set variables for the js.erb view
      @order = @order_item.order
      if redraw_all_pos_items == true
        @order_items = @order.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 7